#Использовать "../src"
#Использовать asserts

&Тест
Процедура Тест() Экспорт
	
	ПутьКФайлу = "./tests/fixtures/xml/call_exception.xml";
	Результат = ОбработкаXML.ПрочитатьОтчетИзФайла(ПутьКФайлу);
	Ожидаем.Что(Результат.ЕстьОшибка).ЕстьИстина();
	Ожидаем.Что(Результат.СодержаниеОшибки).Заполнено();

	ПутьКФайлу = "./tests/fixtures/xml/call_return.xml";
	Результат = ОбработкаXML.ПрочитатьОтчетИзФайла(ПутьКФайлу);
	Ожидаем.Что(Результат.ЕстьОшибка).ЕстьЛожь();
	Ожидаем.Что(Результат.СодержаниеОшибки).ЕстьНеопределено();
КонецПроцедуры